#include <stdio.h>
#include <stdlib.h>
#include "g.h"
#define SOL "----------------------------------------------------------------------------------"
#include "beauty.h"
extern int x,y;
tool tools[100]={
    {1,"大宝剑",1,5,2000,weapon,.attack=9,"亚瑟的专属武器" },
    {2,"藤甲",1,5,2000,armor,.defence=9,"强大的防御力" },
    {3,"玉母蟠桃",1,5,500,con,.power=100,"增加生命值100" },
    {4,"魔法果实",1,5,800,con,.power=1,"永久提高攻击力1" },
    {5,"经验果实",1,10,2000,con,.power=100,"获得1000经验" }
};

MAP maps[8][8]={
    {
    {1,"天山","充满异域文化",1    },
    {2,"楼兰","传说中的鬼城，里面拥有许多宝藏",2   },
    {3,"白蛇山","白蛇山中常年被白蛇占领因此得名，只有武功高强者才能随意进入",3   },
    {4,"野猪林","野猪是这里的主要怪物，他们兼备攻击与防御",4},
    {5,"水晶洞","大侠们的修炼之地，据说里面有许多古代大侠的坟墓",5  },
    {6,"天蚕洞","天蚕教的总舵",6,   },
    {7,"黑风寨","长期被土匪占领",1,   },
    {8,"冰火岛","这里的气候异常，有时非常寒冷有时却十分炎热",1  }
    },
    {
    {9,"迷宫","传说这里可能遇到满级怪物",1   },
    {10,"凌霄城","这里鱼龙混杂，有最大的拍卖场",2   },
    {11,"轩辕岭","轩辕剑的出生之地，这里常常剑气逼人，是修炼剑法的不二之地",3    },
    {12,"华山","华山派的总舵，这里高手云集",4 },
    {13,"嵩山","不详",5  },
    {14,"紫禁城","是正派人士的集聚地，也是大侠们的避难所",6    },
    {15,"快活林","这里有许多低级的怪物",1   },
    {16,"神龙岛","神龙教的总舵，神龙岛的守护神是一只满级的神龙",1   }
    },    {
    {17,"西域","充满异域文化",3 },
    {18,"葫芦谷","充满异域文化",2   },
    {19,"唐门","充满异域文化",3   },
    {20,"终南山","充满异域文化",4   },
    {21,"石窟","充满异域文化",5  },
    {22,"客栈","充满异域文化",6   },
    {23,"玉皇顶","充满异域文化",1  },
    {24,"灵蛇岛","充满异域文化",1   }
    },    {
    {25,"光明顶","充满异域文化",1    },
    {26,"摩天崖","充满异域文化",2   },
    {27,"聚贤庄","充满异域文化",3    },
    {28,"后山","充满异域文化",4  },
    {29,"武当山","充满异域文化",5   },
    {30,"开封府","充满异域文化",6   },
    {31,"二十四桥","充满异域文化",1    },
    {32,"蓬莱仙境","充满异域文化",1   }
    },
     {
    {33,"擂鼓山","充满异域文化",1    },
    {34,"峨眉山","充满异域文化",2   },
    {35,"迷踪林","充满异域文化",3   },
    {36,"五虎岭","充满异域文化",4    },
    {37,"天宁寺","充满异域文化",5   },
    {38,"和善堂","充满异域文化",6    },
    {39,"镇江府","充满异域文化",1    },
    {40,"桃花岛","充满异域文化",1    }
    },
      {
    {41,"恶人谷","充满异域文化",1   },
    {42,"大理","这里是极品装备的出售点，可以买到你想要的装备",2   },
    {43,"百花谷","充满异域文化",3   },
    {44,"孔雀山庄","充满异域文化",4    },
    {45,"五霸岗","充满异域文化",5   },
    {46,"万仞堂","",6  },
    {47,"千年古刹","少林寺的总舵",1    },
    {48,"六合塔","充满异域文化",1  }
    },    {
    {49,"玩偶山庄","是玩偶山庄的总舵",1    },
    {50,"黑木崖","充满异域文化",2  },
    {51,"蝴蝶谷","充满异域文化",3    },
    {52,"铁花堡","充满异域文化",4   },
    {53,"霹雳堂","充满异域文化",5    },
    {54,"关帝庙","充满异域文化",6  },
    {55,"麒麟庄","充满异域文化",1    },
    {56,"销魂宫","充满异域文化",1    }
    },    {
    {57,"石府","充满异域文化",1  },
    {58,"新泽村","这里是理想的田园世界，没有任何怪物，也没有任何武功",2},
    {59,"忏悔崖","充满异域文化",3  },
    {60,"通吃岛","充满异域文化",4   },
    {61,"通天观","充满异域文化",5    },
    {62,"紫霞亭","充满异域文化",6   },
    {63,"天弃魔","充满异域文化",1   },
    {64,"侠客岛","充满异域文化",1   }
    }
};




void show()
{   setcolor(2,0);
    int i,j;


    setposition(18,3);printf("%s",SOL);
    for(i=0;i<8;i++)
    {
        setposition(17,4+i);
         for(j=0;j<8;j++)
       {
            if(j==0)printf("|  ");
         if(i==y&&j==x)  setcolor(4,0);
         printf("%-9s ",maps[i][j].name);
            if(i==y&&j==x) setcolor(2,0);
             if(j==7)printf("|");
       }
      printf("\n");

    }
    setposition(18,12);printf("%s",SOL);
}
void showwelcome()
{
        setposition(18,1);printf("%s",SOL);
        setposition(17,2);printf("|");
        setposition(44,2);setcolor(5,0);printf("*欢迎来到笑傲江湖之精忠报国*");setcolor(2,0);
        setposition(100,2);printf("|");
}

void showdata()
{
    int i;
    for(i=0;i<6;i++)
    {


    setposition(17,10+i);printf("|");
    setposition(100,10+i);printf("|");
    }
    setposition(18,16);printf("%s",SOL);
    setposition(18,17);printf("1.查看资料");
    setposition(18,18);printf("2.回家");
    setposition(18,19);printf("3.查找怪物");
    setposition(18,20);printf("4.退出游戏");
}

void clsdata()
{

    int i,j;

    for(i=0;i<3;i++)
    {setposition(18,13+i);
    for(j=0;j<82;j++)
    {
      printf("@");


    }
    }
}



void showplayer()
{
    setposition(18,13);
}



